#+BEGIN_COMMENT
.. title: Advanced Uses Of SHAP Exercise
.. slug: advanced-uses-of-shap-exercise
.. date: 2020-02-14 20:03:29 UTC-08:00
.. tags: shap,tutorial,machine learning interpretability,visualization
.. category: Visualization
.. link: 
.. description: An exercise in more advanced SHAP interpretability.
.. type: text
.. status: 
.. updated: 

#+END_COMMENT
#+PROPERTY: header-args :session /home/athena/.local/share/jupyter/runtime/kernel-f8b31e0c-7451-4253-80ee-c714b41d00d9.json
#+OPTIONS: ^:{}
#+TOC: headlines 
** Build the Model
   For some reason the notebook switches from a classifier to a regressor, even though this seems to be a classification problem. Since I don't have an explanation for it I'll try it using a classifier instead.

#+begin_src python :results output :exports both
# model = RandomForestRegressor()
model = RandomForestClassifier()
estimators = list(range(30, 300, 10))
max_depth = list(range(10, 100, 10)) + [None]

grid = dict(n_estimators=estimators,
            max_depth=max_depth)
search = RandomizedSearchCV(estimator=model,
                            param_distributions=grid,
                            n_iter=40,
                            n_jobs=-1,
                            random_state=1)
with TIMER:
    search.fit(x_train, y_train)
#+end_src

#+begin_src python :results output :exports both
model = search.best_estimator_
print(f"CV Training Accuracy: {search.best_score_:0.2f}")
print(f"Training Accuracy: {model.score(x_train, y_train): 0.2f}")
print(f"Validation Accuracy: {model.score(x_validation, y_validation):0.2f}")
print(search.best_params_)
#+end_src

#+RESULTS:
: CV Training Accuracy: 0.63
: Training Accuracy:  0.70
: Validation Accuracy: 0.63
: {'n_estimators': 140, 'max_depth': 10}
